Documents/ПоступлениеПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПоступлениеПлатежей</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>InformationRegister.ХранилищеДанныхТабличныхДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пересчитать</Name>
					<Comment>Если признак установлен, сумма в валюте регламентного учета будет пересчитана</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузкаВПроизвольнойВалюте</Name>
					<Comment>Если признак не установлен, задолженность будет загружена в валюте ДО</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяЗадолженность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаПлатежа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВВалютеПлатежа</Name>
							<Comment>Сумма в валюте платежа</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойДолг</Name>
							<Comment>Сумма в валюте загрузки</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проценты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрафы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Составляющая8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыборСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ФорматыЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ФорматыЗагрузки</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыборСоответствий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКартинки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СправочникВладелец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПоступлениеПлатежей/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьТаблицуИмпорта()
	ПолеИсходнойТаблицы.Очистить();
	УправлениеЗагрузкамиДанных.ИзвлечьТабличнуюЧастьВЭлементИзХранилища(ПолеИсходнойТаблицы, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
    ПоместитьВХранилищеДанные();
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилищеДанные()
	Документ = РеквизитФормыВЗначение("Объект");		
	Документ.Записать();
	ЗначениеВРеквизитФормы(Документ, "Объект");
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УправлениеЗагрузкамиДанных.ПоместитьТабличнуюЧастьВХранилище(ПолеИсходнойТаблицы, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВыборСоответствийИмяДанныхОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтр = Элементы.ВыборСоответствий.ТекущиеДанные;
	ТекСтр.ИмяДанных = ВыбранноеЗначение;
	
	Для Каждого Элемент Из СписокРеквизитов Цикл 
		Если Элемент.Представление = ВыбранноеЗначение Тогда	
			ТекСтр.ТипДанных = ВозвратТипЗначенияКолонки(Элемент.Значение);
			Прервать;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ВозвратТипЗначенияКолонки(ВыбранноеЗначение)
	Переменная = Объект.Объекты.Выгрузить().Колонки.Найти(ВыбранноеЗначение).ТипЗначения.Типы()[0];
	Если 	  Переменная = Тип("СправочникСсылка.Контрагенты") Тогда
		Возврат "Справочник ссылка: Контрагенты";
	ИначеЕсли Переменная = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Возврат "Справочник ссылка: Договоры контрагентов";	
	ИначеЕсли Переменная = Тип("СправочникСсылка.УслугиПоДоговору") Тогда
		Возврат "Справочник ссылка: Услуги по договору";	
	ИначеЕсли Переменная = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
		Возврат "Справочник ссылка: Долговые обязательства";
	ИначеЕсли Переменная = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
		Возврат "Справочник ссылка: Исполнительные документы";	
	ИначеЕсли Переменная = Тип("СправочникСсылка.Валюты") Тогда
		Возврат "Справочник ссылка: Валюты";		
	Иначе
		Возврат Объект.Объекты.Выгрузить().Колонки.Найти(ВыбранноеЗначение).ТипЗначения;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокВыбораРеквизитаИмяДанных();
	ЗаполнитьТаблицуИмпорта();
	РаботаСДокументами.ЗаполнитьСписокРеквизитовПоляИмпорта(ПолеИсходнойТаблицы, СписокВыбора);
	Элементы.ВыборСоответствийПараметрыСвязи.СписокВыбора.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьЗначения());
	
	//Заполнение базовых реквизитов в таблицу ВЫБОР СООТВЕТСТВИЙ		
	Если Объект.Ссылка.Пустая() И Объект.ВыборСоответствий.Количество() = 0 Тогда
		//Это новый документ добавленный не копированием
		Для Каждого Элемент Из СписокРеквизитов Цикл
			Если Элемент.Значение = "Объект" Тогда
				НоваяСтрока = Объект.ВыборСоответствий.Добавить();
				НоваяСтрока.ИмяДанных = "Должник";
				НоваяСтрока.ТипДанных = "Справочник ссылка: Контрагенты";
				НоваяСтрока.НомерКартинки = 7;
				
				НоваяСтрока = Объект.ВыборСоответствий.Добавить();
				НоваяСтрока.ИмяДанных = "Долговое обязательство";
				НоваяСтрока.ТипДанных = "Справочник ссылка: Долговые обязательства";
				НоваяСтрока.НомерКартинки = 7;
			Иначе
				НоваяСтрока = Объект.ВыборСоответствий.Добавить();
				НоваяСтрока.ИмяДанных = Элемент.Представление;
				НоваяСтрока.ТипДанных = ВозвратТипЗначенияКолонки(Элемент.Значение);
				//НоваяСтрока.ИмяКолонки = Элемент.Значение;
				НоваяСтрока.НомерКартинки = 7;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#Если ВебКлиент Тогда
		элементы.ПолеИсходнойТаблицы.ОтображатьСетку = Ложь;
		Элементы.ПолеИсходнойТаблицы.ОтображатьЗаголовки = Ложь;
	#КонецЕсли
	
	КонтрольИменТиповЗадолженностиКлиент.УстановитьЗначениеКолонок(Элементы.Объекты.ПодчиненныеЭлементы, "Объекты");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораРеквизитаИмяДанных()
	ТзДанныеЭлементы = Элементы.Объекты.ПодчиненныеЭлементы;
	Для Каждого Элемент Из ТзДанныеЭлементы Цикл	
		Имя = Сред(Элемент.Имя, СтрДлина("Объекты") + 1);
		Попытка   
			Если Элемент.Заголовок = "" Тогда
				Синоним = Метаданные.Документы.ПоступлениеПлатежей.ТабличныеЧасти.Объекты.Реквизиты.Найти(Имя).Синоним;
			Иначе 
				Синоним = Элемент.Заголовок;
			КонецЕсли;		
			Элементы.ВыборСоответствий.ПодчиненныеЭлементы.ВыборСоответствийИмяДанных.СписокВыбора.Добавить(Синоним);			
			СписокРеквизитов.Добавить(Имя,Синоним);
		Исключение
		КонецПопытки;
	КонецЦикла; 		
КонецПроцедуры

&НаКлиенте
Процедура ВыборСоответствийПараметрыСвязиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;              			
	ВыборСоответсвийСвязи(Элемент, ЭтаФорма, Объект.Ссылка, СписокРеквизитов);
КонецПроцедуры

&НаКлиенте
// Выбирает соответствия связи для текущего элемента.
//
// Параметры:
//	Элемент - текущий элемент; 
//  Форма - имя формы; 
//  ДокументОбъект - документ; -
//  СписокРеквизитов - список реквизитов. -
// 
Процедура ВыборСоответсвийСвязи(Элемент, Форма, ДокументОбъект, СписокРеквизитов)
	РаботаСДокументами.ВыборСоответсвийСвязи(Элемент,Элементы,СписокВыбора,Форма,ДокументОбъект,СписокРеквизитов);
//	ТекСтр = Форма.Элементы.ВыборСоответствий.ТекущиеДанные; //ТекущаяСтрока;
//	       
//	Если Нрег(ТекСтр.ТипДанных) = "строка" Тогда
//		ФормаПараметров = ПолучитьФорму("Обработка.УстановкаПараметровСвязи.Форма.ФормаВыбораКолонок",,ЭтаФорма);
//		ФормаПараметров.СписокПараметров = СписокВыбора;
//		
//	ИначеЕсли Нрег(ТекСтр.ТипДанных) = "число" ИЛИ Нрег(ТекСтр.ТипДанных) = "дата" Тогда
//		Элементы.ВыборСоответствий.ТекущиеДанные.ПараметрыСвязи = Форма.ВыбратьИзСписка(СписокВыбора);
//		Возврат;
//		
//	//ИначеЕсли Нрег(Лев(ТекСтр.ТипДанных, 12)) = "перечисление" Тогда
//	//	ФормаПараметров = ПолучитьФорму("ФормаПеречисления",Элемент);
//	//	ТипПеречисления = Форма.Элементы.ВыборСоответствий.ТекущиеДанные.ТипДанных;
//	//	ТипПеречисления = СтрЗаменить(Сред(ТипПеречисления, 21), " ", "");
//	//	//ФормаПараметров.Перечисление = Перечисления[ТипПеречисления].ПустаяСсылка();
//	//	
//	//ИначеЕсли Нрег(ТекСтр.ТипДанных) = Нрег(Строка(Тип("СправочникСсылка.тсЗначенияСвойствОбъектов"))) Тогда
//	//	ФормаПараметров = ПолучитьФорму("ФормаПеречисления",Элемент);
//	//	ИмяКолонки = Форма.Элементы.ВыборСоответствий.ТекущиеДанные.ИмяКолонки;
//	//	КодСвойства = Прав(ИмяКолонки,СтрДлина(ИмяКолонки)-1);
//	//	//ФормаПараметров.Перечисление = ПланыВидовХарактеристик.тсСвойстваОбъектов.НайтиПоКоду(КодСвойства);
//	//	
//	//ИначеЕсли Нрег(ТекСтр.ТипДанных) = "булево" Тогда
//	//	ФормаПараметров = ПолучитьФорму("ФормаПеречисления",Элемент);
//	//	ФормаПараметров.Перечисление = Истина;
//		
//	Иначе
//		ФормаПараметров = ПолучитьФорму("Обработка.УстановкаПараметровСвязи.Форма.ФормаВыбораПараметров",,ЭтаФорма);
//		ФормаПараметров.СписокКолонок = ВозвратКоллекцииРеквизитовСправочника(ТекСтр.ТипДанных);
//		ФормаПараметров.СписокПараметров = РасширитьСписокВыбора(СписокВыбора);	
//		ФормаПараметров.СписокВыбора = СписокВыбора;
//	КонецЕсли;
//	
//	ФормаПараметров.ИзменяемыйЭлемент = Элемент.ТекстРедактирования;	
//	//Чуров
//	ОткрытьФорму(ФормаПараметров);
//	//ФормаПараметров.ОткрытьМодально();
//	Элементы.ВыборСоответствий.ТекущиеДанные.ПараметрыСвязи = ФормаПараметров.Результат;
//	Модифицированность = Истина;
КонецПроцедуры 
	
&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	Объект.Объекты.Очистить();	
	ЗаполнитьДанные(Объект.Ссылка, ПолеИсходнойТаблицы);
КонецПроцедуры

&НаСервере
// Заполняет данные.
//
// Параметры:
//  ДокументОбъект - документ; -
//  ПолеИмпорта  - поле импорта;
// 
Процедура ЗаполнитьДанные(ДокументОбъект, ПолеИмпорта)
	Для НомерСтрокиТаблицыИмпорта = 2 По ПолеИмпорта.ВысотаТаблицы Цикл
		ПустаяСтрокаТаблицы = Истина;
		Для Номер = 1 По ПолеИсходнойТаблицы.ШиринаТаблицы Цикл
			Если ЗначениеЗаполнено(ПолеИсходнойТаблицы.Область("R" + Формат(НомерСтрокиТаблицыИмпорта, "ЧГ=") + "C" + 
					Формат(Номер, "ЧГ=")).Текст) Тогда
				ПустаяСтрокаТаблицы = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПустаяСтрокаТаблицы Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Объекты.Добавить(); 
		Для Каждого ТекСтрока Из Объект.ВыборСоответствий Цикл
			Если Не ЗначениеЗаполнено(ТекСтрока.ПараметрыСвязи) Тогда
				Продолжить;
			КонецЕсли;
			                         
			Если ТекСтрока.ТипДанных = "Строка" Тогда
				Для Каждого Элемент Из СписокРеквизитов Цикл
					Если Элемент.Представление = Строка(ТекСтрока.ИмяДанных) Тогда
						НоваяСтрока[Элемент.Значение] = РаботаСДокументами.СформироватьСтрокуИзДанных82(ТекСтрока.ПараметрыСвязи, 
								НомерСтрокиТаблицыИмпорта, ПолеИмпорта);
						Прервать;
					КонецЕсли
				КонецЦикла;	
				
			ИначеЕсли ТекСтрока.ТипДанных = "Число" Тогда
				Попытка
					Результат = Число(СтрЗаменить(РаботаСДокументами.НайтиЗначениеВТаблицеИмпорта(НомерСтрокиТаблицыИмпорта, 
							ТекСтрока.ПараметрыСвязи, ПолеИмпорта), " ", ""));
				Исключение
					Результат = 0;
				КонецПопытки;
				
				Для Каждого Элемент Из СписокРеквизитов Цикл
					Если Элемент.Представление = Строка(ТекСтрока.ИмяДанных) Тогда
						НоваяСтрока[Элемент.Значение] = Результат;
						Прервать;
					КонецЕсли
				КонецЦикла;
				
			ИначеЕсли ТекСтрока.ТипДанных = "Дата" Тогда
				Попытка
					Результат = Дата(РаботаСДокументами.НайтиЗначениеВТаблицеИмпорта(НомерСтрокиТаблицыИмпорта, 
							ТекСтрока.ПараметрыСвязи, ПолеИмпорта));
				Исключение
					Результат = Технический.ПреобразоватьДату(РаботаСДокументами.НайтиЗначениеВТаблицеИмпорта(
							НомерСтрокиТаблицыИмпорта, ТекСтрока.ПараметрыСвязи, ПолеИмпорта));
				КонецПопытки;
						
				Для Каждого Элемент Из СписокРеквизитов Цикл
					Если Элемент.Представление = Строка(ТекСтрока.ИмяДанных) Тогда
						НоваяСтрока[Элемент.Значение] = Результат;
						Прервать;
					КонецЕсли
				КонецЦикла;
					
			//ИначеЕсли Найти(ТекСтрока.ТипДанных,  "Перечисление ссылка:") = 1 
			//		Или НРег(ТекСтрока.ТипДанных) = Нрег(Строка(Тип("СправочникСсылка.тсЗначенияСвойствОбъектов"))) 
			//		Или ТекСтрока.ТипДанных = "Булево" Тогда
			//	НайтиИЗаписатьПеречисление(ТекСтрока, НоваяСтрока, НомерСтрокиТаблицыИмпорта, ПолеИмпорта);
				       
			Иначе	
			    Для Каждого Элемент Из СписокРеквизитов Цикл
					Если ТекСтрока.ИмяДанных = "Должник" Тогда
						РаботаСДокументами.НайтиИЗаписатьДокументИлиСправочник81("Объект", ТекСтрока.ТипДанных, 
								ТекСтрока.ПараметрыСвязи, НоваяСтрока, НомерСтрокиТаблицыИмпорта, ПолеИмпорта);
						ВладелецДолжник = НоваяСтрока.Объект;
						// Боевкин 07.07.2017 
						// НоваяСтрока.Объект = Неопределено;
						////////////////////////////////////
						Прервать;
					ИначеЕсли ТекСтрока.ИмяДанных = "Долговое обязательство" Тогда
						РаботаСДокументами.НайтиИЗаписатьДокументИлиСправочник81("Объект", ТекСтрока.ТипДанных, 
								ТекСтрока.ПараметрыСвязи, НоваяСтрока, НомерСтрокиТаблицыИмпорта, ПолеИмпорта, 
								ВладелецДолжник);
						Прервать;
					ИначеЕсли Элемент.Представление = Строка(ТекСтрока.ИмяДанных) Тогда
						РаботаСДокументами.НайтиИЗаписатьДокументИлиСправочник81(Элемент.Значение, ТекСтрока.ТипДанных, 
								ТекСтрока.ПараметрыСвязи, НоваяСтрока, НомерСтрокиТаблицыИмпорта, ПолеИмпорта);		
						Прервать;
					КонецЕсли;		
				КонецЦикла;				
			КонецЕсли;
		КонецЦикла;
		Если не ЗначениеЗаполнено(НоваяСтрока.ДатаПлатежа) ИЛИ Не ЗначениеЗаполнено(НоваяСтрока.Объект) Тогда
			Объект.Объекты.Удалить(НоваяСтрока.НомерСтроки-1);
		КонецЕсли;
	КонецЦикла;
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаВыборСоответствий" Тогда
		РаботаСДокументами.ЗаполнитьСписокРеквизитовПоляИмпорта(ПолеИсходнойТаблицы, СписокВыбора);
		Элементы.ВыборСоответствийПараметрыСвязи.СписокВыбора.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьЗначения());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектыСервер.ОграничитьТипОбъекта(Элементы.ОбъектыОбъект);
	
	//
	Если Объект.Ссылка.Пустая() Тогда
		Пользователи.ЗаполнитьРеквизитыПоДаннымПользователя(Объект);
	КонецЕсли;	
	
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ВыборСоответствийПередНачаломИзменения(Элемент, Отказ)
	Если Элементы.ВыборСоответствий.ТекущиеДанные.ТипДанных = "Число" ИЛИ
			Элементы.ВыборСоответствий.ТекущиеДанные.ТипДанных = "Дата" Тогда
		Элементы.ВыборСоответствийПараметрыСвязи.КнопкаВыбора = Ложь;
	Иначе
		Элементы.ВыборСоответствийПараметрыСвязи.КнопкаВыбора = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборСоответствийПараметрыСвязиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВыбранноеЗначение = УправлениеЗагрузкойКлиент.ВыборСоответствийДляДокументовПоЗадолженности(Элемент, ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиСоответствий(Команда)
	ОткрытьФорму("Справочник.ФорматыЗагрузки.Форма.ФормаЭлемента",, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиСоответствий(Команда)
	ОткрытьФорму("Справочник.ФорматыЗагрузки.Форма.ФормаВыбора",, ЭтаФорма);
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьВыборСоответствий(Результат)
	Объект.ВыборСоответствий.Загрузить(Результат.ВыборСоответствий.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьДанные(Команда)
	Объект.Объекты.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ВыборСоответствийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбъектыСервер.РасширитьТабличнуюЧасть(Объект.Объекты);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыОбъектПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтроку(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыПолеПриИзменении(Элемент)
	ОбъектыКлиент.РасширитьТекущуюСтрокуОбъект(Элемент);
КонецПроцедуры

#Область СчитатьФайл

&НаКлиенте
Асинх Процедура ПрочитатьФайлСКлиента()

	ДанныеПрочитанногоФайла = Неопределено;
	Попытка
	
		ДанныеПрочитанногоФайла = Ждать УправлениеЗагрузкойКлиент.ИмпортироватьФайл(ЭтаФорма.УникальныйИдентификатор);
	
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(ДанныеПрочитанногоФайла) Тогда
	
		Возврат;
	
	КонецЕсли;
	
	ПолеИсходнойТаблицы = ДанныеПрочитанногоФайла["ТабличныйДокумент"];
	ФайлИмпорта = ДанныеПрочитанногоФайла["ПутьФайлаНаКлиенте"];

КонецПроцедуры

&НаКлиенте
Процедура ФайлИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПрочитатьФайлСКлиента();
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ФорматЗагрузкиВыбор" Тогда
		Если Параметр <> Неопределено Тогда
			ЗагрузитьВыборСоответствий(Параметр);
		КонецЕсли; 	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РасширитьСписокВыбора(СписокВыбора)
	РасширенныйСписок = Новый СписокЗначений;	
	РасширенныйСписок.ЗагрузитьЗначения(СписокВыбора.ВыгрузитьЗначения());
	
	Для Каждого Элемент ИЗ СписокРеквизитов Цикл
		НовСтрока = РасширенныйСписок.Добавить();
		НовСтрока.Значение = Элемент.Значение + "_";
		НовСтрока.Картинка = БиблиотекаКартинок.Справочник; 
	КонецЦикла;
	
	Возврат РасширенныйСписок;
КонецФункции

&НаСервере
Функция ВозвратКоллекцииРеквизитовСправочника(ТипДанных)
	ТипРеквизитаСтр = СтрЗаменить(ТипДанных," ","");
		
	СписокВсехПараметров = Новый СписокЗначений;
	Если Лев(ТипРеквизитаСтр,10) = "Справочник" Тогда
		СправочникРеквизита = Сред(ТипРеквизитаСтр,18);
		РеквизитОбъект = Метаданные.Справочники.Найти(СправочникРеквизита).Реквизиты;
		СписокВсехПараметров.Добавить("Код");
		СписокВсехПараметров.Добавить("Наименование");
		Если Метаданные.Справочники.Найти(СправочникРеквизита).Владельцы.Количество() > 0 Тогда
			СписокВсехПараметров.Добавить("Владелец");
		КонецЕсли;
	ИначеЕсли Лев(ТипРеквизитаСтр,8) = "Документ" Тогда
		СписокВсехПараметров.Добавить("Номер");
		СписокВсехПараметров.Добавить("Дата");
	КонецЕсли;

	Если Не РеквизитОбъект = Неопределено Тогда	
		Для Каждого СвойствоРеквизит ИЗ РеквизитОбъект Цикл
			НовСтрока = СписокВсехПараметров.Добавить();
			НовСтрока.Значение = СвойствоРеквизит.Имя;
		КонецЦикла;
	КонецЕсли;

	Возврат СписокВсехПараметров;	
КонецФункции
